app/controllers/application_controller.rb

  def authorize_request
    begin
      byebug
      token = request.headers['Authorization'].split(' ').last
      decoded = JsonWebToken.decode(token)

      if decoded.nil?
        render json: { error: 'Unauthorized' }, status: :unauthorized
      else
        # Encuentra el usuario según el ID del payload
        @current_user = User.find_by(slug: decoded[:slug])
---
SELECT `users`.* FROM `users` WHERE `users`.`slug` = 'c18016e9-f801-4227-af21-642712cd1ecb' LIMIT 1