app/controllers/car_controller.rb

SELECT `cars`.* FROM `cars`
SELECT 1 AS one FROM `cars` LIMIT 1
---
  def index
    begin

      cars = Car.all

      cars.any? ? render(json: cars) : render_not_found("Car not found")

INSERT INTO `cars` (`plate_number`, `model`, `year`, `slug`, `created_at`, `updated_at`) VALUES (NULL, 'HNTR', 2024, 'f2a1861f-472f-429e-b829-22ea458f759b', '2025-01-04 14:29:50', '2025-01-04 14:29:50')
---
  def create
    begin
      result  = Car.saveCard(params)

UPDATE `cars` SET `cars`.`plate_number` = 'GHSS3UUpdate', `cars`.`year` = 2025, `cars`.`updated_at` = '2025-01-04 15:27:51' WHERE `cars`.`id` = 7
---
  def update
    begin
      result = Car.updateCar(params)

DELETE FROM `cars` WHERE `cars`.`id` = 7
---
  def destroy
    begin
      result = Car.deleteCar(params[:id])