app/controllers/login_controller.rb

  def auth
    begin

      @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'emmanuel@email.com' LIMIT 1

  def create
    begin
      result  = User.saveUser(params)
---
INSERT INTO `users` (`rfc`, `name`, `email`, `password_digest`, `phone`, `nikename`, `image`, `provider`, `uid`, `reset_password_token`, `reset_password_sent_at`, `allow_password_change`, `remember_created_at`, `confirmation_token`, `confirmed_at`, `confirmation_sent_at`, `unconfirmed_email`, `tokens`, `status`, `slug`, `created_at`, `updated_at`) VALUES (NULL, NULL, 'emmanuel@email.com', '$2a$12$0iBuqeKfe4c7IIMLt2l8re0oABtItZZ2yqacle.mbbgeypBbntM4m', NULL, NULL, NULL, 'email', '', NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'd6dc128a-8396-4d3b-8cf9-a9e1aaa54420', '2025-01-04 17:59:25', '2025-01-04 17:59:25')