app/controllers/maintenance_service_controller.rb

  def index
    begin
      maintenance_services = MaintenanceService.all

      maintenance_services.any? ? render(json: maintenance_services) : render_not_found("Maintenance Service not found")
---
SELECT `maintenance_services`.* FROM `maintenance_services`
SELECT 1 AS one FROM `maintenance_services` LIMIT 1

  def create
    begin
      result  = MaintenanceService.saveMaintenanceService(params)
---
INSERT INTO `maintenance_services` (`description`, `status`, `date`, `car_id`, `slug`, `created_at`, `updated_at`) VALUES ('123123', '123132', NULL, 16, '2ad7f616-48a4-44ab-b69e-ddc7990b4528', '2025-01-04 16:41:57', '2025-01-04 16:41:57')

  def update
    begin
      result = MaintenanceService.updateMaintenanceService(params)
---
UPDATE `maintenance_services` SET `maintenance_services`.`description` = '1231', `maintenance_services`.`updated_at` = '2025-01-04 16:49:30' WHERE `maintenance_services`.`id` = 9

  def destroy
    begin
      result = MaintenanceService.deleteMaintenanceService((params[:id]))
---
DELETE FROM `maintenance_services` WHERE `maintenance_services`.`id` = 9