app/models/car.rb

INSERT INTO `cars` (`plate_number`, `model`, `year`, `slug`, `created_at`, `updated_at`) VALUES (NULL, 'HNTR', 2024, 'f2a1861f-472f-429e-b829-22ea458f759b', '2025-01-04 14:29:50', '2025-01-04 14:29:50')
---
  def self.saveCard(data)

    car = {
      plate_number: data[:plateNumber],
      model: data[:model],
      year: data[:year],
      slug: SecureRandom.uuid
    }
    result = Car.new(car)

    if result.save

SELECT `cars`.* FROM `cars` WHERE `cars`.`slug` = 'f97d484c-a36c-45df-8a1d-02c1993d796e' LIMIT 1
UPDATE `cars` SET `cars`.`plate_number` = 'GHSS3UUpdate', `cars`.`year` = 2025, `cars`.`updated_at` = '2025-01-04 15:27:51' WHERE `cars`.`id` = 7
---
  def self.updateCar(data)

    carParams = {
      plate_number: data[:plateNumber],
      model: data[:model],
      year: data[:year]
    }
    car = Car.find_by(slug: data[:id])

    if car.update(carParams)

DELETE FROM `cars` WHERE `cars`.`id` = 7
SELECT `cars`.* FROM `cars` WHERE `cars`.`slug` = 'f97d484c-a36c-45df-8a1d-02c1993d796e' LIMIT 1
---
  def self.deleteCar(id)
    return  Car.find_by(slug: id).destroy