app/models/maintenance_service.rb

  def self.saveMaintenanceService(data)

    maintenance_service = {
      description: data[:description],
      status: data[:status],
      date: data[:date],
      slug: SecureRandom.uuid,
      car_id: Car.find_by(slug: data[:slugCar]).id,
    }
    result = MaintenanceService.new(maintenance_service)

    if result.save
---
SELECT `cars`.* FROM `cars` WHERE `cars`.`slug` = '8ee9bc4e-fdca-439a-b700-f68a2a68668f' LIMIT 1
INSERT INTO `maintenance_services` (`description`, `status`, `date`, `car_id`, `slug`, `created_at`, `updated_at`) VALUES ('123123', '123132', NULL, 16, '2ad7f616-48a4-44ab-b69e-ddc7990b4528', '2025-01-04 16:41:57', '2025-01-04 16:41:57')

  def self.updateMaintenanceService(data)

    maintenance_service_params = {
      description: data[:description],
      status: data[:status],
      date: data[:date],
    }
    maintenance_service = MaintenanceService.find_by(slug: data[:id])

    if maintenance_service.update(maintenance_service_params)
---
SELECT `maintenance_services`.* FROM `maintenance_services` WHERE `maintenance_services`.`slug` = '8ee9bc4e-fdca-439a-b700-f68a2a68668f' LIMIT 1
UPDATE `maintenance_services` SET `maintenance_services`.`description` = '1231', `maintenance_services`.`updated_at` = '2025-01-04 16:49:30' WHERE `maintenance_services`.`id` = 9

  def self.deleteMaintenanceService(id)
    return  MaintenanceService.find_by(slug: id).destroy
---
DELETE FROM `maintenance_services` WHERE `maintenance_services`.`id` = 9
SELECT `maintenance_services`.* FROM `maintenance_services` WHERE `maintenance_services`.`slug` = 'c80e3290-d160-401f-97b8-cf9128af195f' LIMIT 1