app/models/user.rb

  def self.saveUser(data)

    user = {
      email: data[:email],
      name: data[:name],
      password: data[:password],
      slug: SecureRandom.uuid,
      status: data[:status],
    }
    result = User.new(user)

    if result.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `phone`, `nikename`, `image`, `provider`, `uid`, `reset_password_token`, `reset_password_sent_at`, `allow_password_change`, `remember_created_at`, `confirmation_token`, `confirmed_at`, `confirmation_sent_at`, `unconfirmed_email`, `tokens`, `status`, `slug`, `created_at`, `updated_at`) VALUES ('EMMANUEL ALVARO RODRIGUEZ HERNANDEZ', 'emmanuel@email.com', '$2a$12$brg5OS9K7cFiwz3LO0NsNuI8p63VQCc90hWlfNM1lEJr6WSAtKPTK', NULL, NULL, NULL, 'email', '', NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'c18016e9-f801-4227-af21-642712cd1ecb', '2025-01-04 18:04:55', '2025-01-04 18:04:55')